Процедура ПрограммноеФормированиеРеквизитов(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда 
		ДобавитьРеквизитНаФормуШапка(Форма); 
		ДобавитьРеквизитНаФормуСкидка(Форма)
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда  
		ДобавитьРеквизитНаФормуПередСуммой(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда   
		ДобавитьРеквизитНаФормуПередСуммой(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьРеквизитНаФормуШапка(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьРеквизитНаФормуШапка(Форма);
		
	КонецЕсли;	
КонецПроцедуры


Процедура ДобавитьРеквизитНаФормуШапка(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо",Тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.С_КонтактноеЛицо"
	
КонецПроцедуры

Процедура ДобавитьРеквизитНаФормуПередСуммой(Форма)
	
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо",Тип("ПолеФормы"),,Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.С_КонтактноеЛицо"
	
КонецПроцедуры

Процедура ДобавитьРеквизитНаФормуСкидка(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить("СогласованнаСкидка",Тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаЛево);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.С_Скидка";
	ПолеВвода.УстановитьДействие("ПриИзменении","С_СкидкаПриИзмененииПосле");  
	
	НоваяКоманда = Форма.Команды.Добавить("КомандаПересчета");
	НоваяКоманда.Заголовок = "Общая команда";
	НоваяКоманда.Действие = "С_ПересчетТаблицыПосле";
	
	НовыйЭлемент = Форма.Элементы.Добавить("КнопкаКомандаПересчета", Тип("КнопкаФормы"),Форма.Элементы.ГруппаШапкаЛево);
	НовыйЭлемент.Заголовок = "Пересчет таблицы";
	НовыйЭлемент.ИмяКоманды = "КомандаПересчета";
	
КонецПроцедуры

